Why Pandas ? It is library that provides fast data cleaning, preparation and analysis & is easy to use for data visualization & Machine Learning.  

What is pandas? It is Built on top of NumPy, Which makes it easy to work  
with array & matrices(Called Series % Dataframes in Pandas)

# pandas: The Python Data Analysis Library

pandas is an open source Python library for highly specialized data analysis. It is  
currently the reference point that all professionals using the Python language need to  
study for the statistical purposes of analysis and decision making.

In [1]:
import pandas as pd
import numpy as np

In [2]:
pd.__version__

'1.0.3'

In [2]:
from pandas import *

The heart of pandas is the two primary data structures on which all transactions, which  
are generally made during the analysis of data, are centralized:  
• Series  
• Dataframes

The series, as you will see, constitutes the data structure designed to accommodate a  
sequence of one-dimensional data, while the dataframe, a more complex data structure,  
is designed to contain cases with several dimensions

# The Series

The series is the object of the pandas library designed to represent one-dimensional data  
structures, similar to an array but with some additional features. Its internal structure is  
simple (see Figure 4-1) and is composed of two arrays associated with each other. The  
main array holds the data (data of any NumPy type) to which each element is associated  
with a label, contained within the other array, called the index.

# Declaring a Series

To create the series, you simply call the Series() constructor and  
pass as an argument an array containing the values to be included in it

In [3]:
ser = pd.Series()

C:\Users\ferna\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  """Entry point for launching an IPython kernel.

In [4]:
data = np.array(['g', 'e', 'e', 'k', 's'])

In [5]:
ser = pd.Series(data) 
print(ser)

0    g
1    e
2    e
3    k
4    s
dtype: object

In [10]:
s = pd.Series([12,-4,7,9], index=['a','b','c','d'])
s

a    12
b    -4
c     7
d     9
dtype: int64

If you want to individually see the two arrays that make up this data structure, you  
can call the two attributes of the series as follows: index and values.

In [11]:
s.values

array([12, -4,  7,  9], dtype=int64)

In [12]:
s.index

Index(['a', 'b', 'c', 'd'], dtype='object')

## Selecting the Internal Elements

You can select individual elements as ordinary numpy arrays, specifying the key.

In [13]:
s[2]

7

Or you can specify the label corresponding to the position of the index.

In [14]:
s['c']

7

In the same way you select multiple items in a numpy array, you can specify the
following

In [15]:
s[0:2]

a    12
b    -4
dtype: int64

In this case, you can use the corresponding labels, but specify the list of labels in an
array.

In [17]:
s[['b','c']]

b   -4
c    7
dtype: int64

Exercises of declaring series.

In [6]:
temperature = pd.Series([21,20,22], index=['London','New York', 'Helsinki'])
temperature

London      21
New York    20
Helsinki    22
dtype: int64

In [9]:
temperature['New York']

20

In [11]:
capital = pd.Series(['Salvador','Belo Horizonte','São Paulo'], index=['Bahia','Minas Gerais','São Paulo'])
capital

Bahia                 Salvador
Minas Gerais    Belo Horizonte
São Paulo            São Paulo
dtype: object

In [12]:
capital['Bahia']

'Salvador'

In [23]:
capital.values

array(['Salvador', 'Belo Horizonte', 'São Paulo'], dtype=object)

In [22]:
numeros = pd.Series([12,9,4,9,-1])
numeros

0    12
1     9
2     4
3     9
4    -1
dtype: int64

In [13]:
produtos_preco = pd.Series([4,2.5,2.9,7.45], index=['Pão','Leite','Acúcar','Café'])
produtos_preco

Pão       4.00
Leite     2.50
Acúcar    2.90
Café      7.45
dtype: float64

In [15]:
produtos_preco['Pão']

4.0

In [25]:
classicos_futebol = pd.Series(['Palmeira','Internacional','Flamengo','Cruzeiro'], index=['Corinthians','Grêmio','Fluminense','Atlético Mineiro'])
classicos_futebol

Corinthians              Palmeira
Grêmio              Internacional
Fluminense               Flamengo
Atlético Mineiro         Cruzeiro
dtype: object

# Assigning Values to the Elements  
Now that you understand how to select individual elements, you also know how to  
assign new values to them. In fact, you can select the value by index or by label.

In [16]:
produtos_preco

Pão       4.00
Leite     2.50
Acúcar    2.90
Café      7.45
dtype: float64

In [17]:
produtos_preco['Pão'] = 3.50

In [18]:
produtos_preco

Pão       3.50
Leite     2.50
Acúcar    2.90
Café      7.45
dtype: float64

## Defining a Series from NumPy Arrays and Other Series  
You can define a new series starting with NumPy arrays or with an existing series

In [19]:
arr = np.array([1,2,3,4])
s3 = pd.Series(arr)
s3

0    1
1    2
2    3
3    4
dtype: int32

# Filtering Values  
Thanks to the choice of the NumPy library as the base of the pandas library and, as a  
result, for its data structures, many operations that are applicable to NumPy arrays are  
extended to the series. One of these is filtering values contained in the data structure  
through conditions.  
For example, if you need to know which elements in the series are greater than 3, you  
write the following:

In [21]:
produtos_preco

Pão       3.50
Leite     2.50
Acúcar    2.90
Café      7.45
dtype: float64

In [22]:
produtos_preco[produtos_preco > 3]

Pão     3.50
Café    7.45
dtype: float64

In [24]:
produtos_preco[produtos_preco < 3]

Leite     2.5
Acúcar    2.9
dtype: float64

# Operations and Mathematical Functions  
Other operations such as operators (+, -, *, and /) and mathematical functions that are  
applicable to NumPy array can be extended to series.  
You can simply write the arithmetic expression for the operators

In [26]:
numeros = pd.Series([8,2,10,15,21,9,4,7])

In [27]:
numeros

0     8
1     2
2    10
3    15
4    21
5     9
6     4
7     7
dtype: int64

In [28]:
numeros/2

0     4.0
1     1.0
2     5.0
3     7.5
4    10.5
5     4.5
6     2.0
7     3.5
dtype: float64

In [29]:
numeros * 3

0    24
1     6
2    30
3    45
4    63
5    27
6    12
7    21
dtype: int64

In [30]:
numeros - 10

0    -2
1    -8
2     0
3     5
4    11
5    -1
6    -6
7    -3
dtype: int64

In [31]:
numeros + 100

0    108
1    102
2    110
3    115
4    121
5    109
6    104
7    107
dtype: int64

In [32]:
numeros ** 2

0     64
1      4
2    100
3    225
4    441
5     81
6     16
7     49
dtype: int64

In [33]:
np.sqrt(numeros)

0    2.828427
1    1.414214
2    3.162278
3    3.872983
4    4.582576
5    3.000000
6    2.000000
7    2.645751
dtype: float64

# Evaluating Vales
There are often duplicate values in a series. Then you may need to have more  
information about the samples, including existence of any duplicates and whether a  
certain value is present in the series.  
In this regard, you can declare a series in which there are many duplicate values

In [36]:
duplicado = pd.Series([1,2,0,1,2,3], index=['white','black','white','blue','blue','orange'])
duplicado

white     1
black     2
white     0
blue      1
blue      2
orange    3
dtype: int64

To know all the values contained in the series, excluding duplicates, you can use  
the unique() function. The return value is an array containing the unique values in the  
series, although not necessarily in order.

In [37]:
unique(duplicado)

array([1, 2, 0, 3], dtype=int64)

A function that’s similar to unique() is value_counts(), which not only returns
unique values but also calculates the occurrences within a series.

In [38]:
value_counts(duplicado)

2    2
1    2
3    1
0    1
dtype: int64

Finally, isin() evaluates the membership, that is, the given a list of values. This  
function tells you if the values are contained in the data structure. Boolean values that are  
returned can be very useful when filtering data in a series or in a column of a dataframe

In [39]:
duplicado.isin([0,3])

white     False
black     False
white      True
blue      False
blue      False
orange     True
dtype: bool

# NaN Values  
As you can see in the previous case, we tried to run the logarithm of a negative number  
and received NaN as a result. This specific value NaN (Not a Number) is used in pandas  
data structures to indicate the presence of an empty field or something that’s not  
definable numerically.  
Generally, these NaN values are a problem and must be managed in some way,  
especially during data analysis. These data are often generated when extracting data  
from a questionable source or when the source is missing data. Furthermore, as you  
have just seen, the NaN values can also be generated in special cases, such as calculations  
of logarithms of negative values, or exceptions during execution of some calculation  
or function. In later chapters, you see how to apply different strategies to address the  
problem of NaN values.

Despite their problematic nature, however, pandas allows you to explicitly define  
NaNs and add them to a data structure, such as a series. Within the array containing the  
values, you enter np.NaN wherever you want to define a missing value.

In [1]:
import pandas as pd
import numpy as np
from pandas import *
s2 = pd.Series([5,-3,np.NaN,14])

In [4]:
s2

0     5.0
1    -3.0
2     NaN
3    14.0
dtype: float64

The isnull() and notnull() functions are very useful to identify the indexes  
without a value.

In [5]:
s2.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [6]:
s2.notnull()

0     True
1     True
2    False
3     True
dtype: bool

In fact, these functions return two series with Boolean values that contain the True  
and False values, depending on whether the item is a NaN value or less. The isnull()  
function returns True at NaN values in the series; inversely, the notnull() function  
returns True if they are not NaN. These functions are often placed inside filters to make a  
condition.

In [7]:
s2[s2.notnull()]

0     5.0
1    -3.0
3    14.0
dtype: float64

In [8]:
s2[s2.isnull()]

2   NaN
dtype: float64

# Series as Dictionaries
An alternative way to think of a series is to think of it as an object dict (dictionary). This  
similarity is also exploited during the definition of an object series. In fact, you can create  
a series from a previously defined dict.

In [3]:
mercadoria = {'Pão':2.40,'Leite':1.80,'Café':4.50,'Margarina':3.40}

In [4]:
produtos = pd.Series(mercadoria)
produtos

Pão          2.4
Leite        1.8
Café         4.5
Margarina    3.4
dtype: float64

As you can see from this example, the array of the index is filled with the keys while  
the data are filled with the corresponding values. You can also define the array indexes  
separately. In this case, controlling correspondence between the keys of the dict and  
labels array of indexes will run. If there is a mismatch, pandas will add the NaN value.

In [6]:
mercadorias = {'Pão':3.45,'Leite':8.80,'Café':5.50,'Margarina':7.40}

In [7]:
produtos1 = pd.Series(mercadorias)

In [8]:
produtos1

Pão          3.45
Leite        8.80
Café         5.50
Margarina    7.40
dtype: float64

In [10]:
# soma de séries
produtos + produtos1

Pão           5.85
Leite        10.60
Café         10.00
Margarina    10.80
dtype: float64

# The DataFrame
The dataframe is a tabular data structure very similar to a spreadsheet. This data  
structure is designed to extend series to multiple dimensions. In fact, the dataframe  
consists of an ordered collection of columns (see Figure 4-2), each of which can contain  
a value of a different type (numeric, string, Boolean, etc.).

Unlike series, which have an index array containing labels associated with each  
element, the dataframe has two index arrays. The first index array, associated with  
the lines, has very similar functions to the index array in series. In fact, each label is  
associated with all the values in the row. The second array contains a series of labels,  
each associated with a particular column.  
A dataframe may also be understood as a dict of series, where the keys are the  
column names and the values are the series that will form the columns of the dataframe.  
Furthermore, all elements in each series are mapped according to an array of labels,  
called the index.

# Defining a Dataframe
The most common way to create a new dataframe is precisely to pass a dict object to the  
DataFrame() constructor. This dict object contains a key for each column that you want  
to define, with an array of values for each of them.

In [26]:
Dados = {'color':['blue','green','yellow','red','white'],
        'object':['ball','pen','pencil','paper','mug'],
         'price':[1.2,1.0,0.6,0.9,1.7]}

In [27]:
Dados

{'color': ['blue', 'green', 'yellow', 'red', 'white'],
 'object': ['ball', 'pen', 'pencil', 'paper', 'mug'],
 'price': [1.2, 1.0, 0.6, 0.9, 1.7]}

In [28]:
frame = pd.DataFrame(Dados)

In [29]:
frame

    color  object  price
0    blue    ball    1.2
1   green     pen    1.0
2  yellow  pencil    0.6
3     red   paper    0.9
4   white     mug    1.7

If the dict object from which you want to create a dataframe contains more data  
than you are interested in, you can make a selection. In the constructor of the dataframe,  
you can specify a sequence of columns using the columns option. The columns will be  
created in the order of the sequence regardless of how they are contained in the dict  
object

In [31]:
frame2 = pd.DataFrame(Dados, columns=['object','price'])

In [32]:
frame2

   object  price
0    ball    1.2
1     pen    1.0
2  pencil    0.6
3   paper    0.9
4     mug    1.7

Even for dataframe objects, if the labels are not explicitly specified in the Index array,  
pandas automatically assigns a numeric sequence starting from 0. Instead, if you want to  
assign labels to the indexes of a dataframe, you have to use the index option and assign it  
an array containing the labels.

In [34]:
frame2 = pd.DataFrame(Dados, index=['one','two','three','four','five'])

In [35]:
frame2

        color  object  price
one      blue    ball    1.2
two     green     pen    1.0
three  yellow  pencil    0.6
four      red   paper    0.9
five    white     mug    1.7

Exercises to create a dataframe

In [2]:
import pandas as pd
import numpy as np
from pandas import *
dados1 = {'Produtos':['Pão de queijo','Pão','Leite','Acúcar'],
          'Quantidade':[27,22,14,11],
          'Preço':[2.55,2.10,3.10,1.80]
         }

In [37]:
frame5 = pd.DataFrame(dados1)

In [38]:
frame5

        Produtos  Quantidade  Preço
0  Pão de queijo          27   2.55
1            Pão          22   2.10
2          Leite          14   3.10
3         Acúcar          11   1.80

In [1]:
dados2 = {'Alunos':['Pedro','Henrique','Manoel','Fabio'],
          'Disciplinas':['Matemática','Português','Física','Química'],
         'Notas':[8,10,5,3]}

In [3]:
frame2 = pd.DataFrame(dados2)

In [4]:
frame2

                                         Dados Alunoa
Alunos               [Pedro, Henrique, Manoel, Fabio]
Disciplinas  [Matemática, Português, Física, Química]
Notas                                   [8, 10, 5, 3]

In [14]:
frame5 = pd.DataFrame(dados2, columns=['Alunos','Notas'])

In [15]:
frame5

     Alunos  Notas
0     Pedro      8
1  Henrique     10
2    Manoel      5
3     Fabio      3

# Selecting Elements
If you want to know the name of all the columns of a dataframe, you can is specify the  
columns attribute on the instance of the dataframe object.

In [16]:
frame2.columns

Index(['Alunos', 'Disciplinas', 'Notas'], dtype='object')

You can also get the entire set of data contained within the data structure using the  
values attribute

In [17]:
frame2.values

array([['Pedro', 'Matemática', 8],
       ['Henrique', 'Português', 10],
       ['Manoel', 'Física', 5],
       ['Fabio', 'Química', 3]], dtype=object)

Or, if you are interested in selecting only the contents of a column, you can write the  
name of the column.

In [18]:
frame2['Notas']

0     8
1    10
2     5
3     3
Name: Notas, dtype: int64

As you can see, the return value is a series object. Another way to do this is to use the  
column name as an attribute of the instance of the dataframe.

In [19]:
frame2.Notas

0     8
1    10
2     5
3     3
Name: Notas, dtype: int64

For rows within a dataframe, it is possible to use the loc attribute with the index  
value of the row that you want to extract.

In [20]:
frame2.loc[2]

Alunos         Manoel
Disciplinas    Física
Notas               5
Name: 2, dtype: object

In [21]:
frame2.loc[3]

Alunos           Fabio
Disciplinas    Química
Notas                3
Name: 3, dtype: object

The object returned is again a series in which the names of the columns have  
become the label of the array index, and the values have become the data of series.  
To select multiple rows, you specify an array with the sequence of rows to insert:

In [23]:
frame2.loc[[0,3]]

  Alunos Disciplinas  Notas
0  Pedro  Matemática      8
3  Fabio     Química      3

If you need to extract a portion of a DataFrame, selecting the lines that you want to  
extract, you can use the reference numbers of the indexes. In fact, you can consider a  
row as a portion of a dataframe that has the index of the row as the source (in the next 0)  
value and the line above the one we want as a second value (in the next one).

In [24]:
frame2[0:2]

     Alunos Disciplinas  Notas
0     Pedro  Matemática      8
1  Henrique   Português     10

Finally, if what you want to achieve is a single value within a dataframe, you first use  
the name of the column and then the index or the label of the row.

In [25]:
frame2['Disciplinas'][3]

'Química'

# Assigning Values
Once you understand how to access the various elements that make up a dataframe, you  
follow the same logic to add or change the values in it.  
For example, you have already seen that within the dataframe structure, an array  
of indexes is specified by the index attribute, and the row containing the name of the  
columns is specified with the columns attribute. Well, you can also assign a label, using  
the name attribute, to these two substructures to identify them.

In [26]:
frame2

     Alunos Disciplinas  Notas
0     Pedro  Matemática      8
1  Henrique   Português     10
2    Manoel      Física      5
3     Fabio     Química      3

In [27]:
frame2.index.name = 'id'
frame2.columns.name = 'item'

In [28]:
frame2

item    Alunos Disciplinas  Notas
id
0        Pedro  Matemática      8
1     Henrique   Português     10
2       Manoel      Física      5
3        Fabio     Química      3

One of the best features of the data structures of pandas is their high flexibility. In  
fact, you can always intervene at any level to change the internal data structure. For  
example, a very common operation is to add a new column.  
You can do this by simply assigning a value to the instance of the dataframe and  
specifying a new column name.

In [29]:
frame2['Ano'] = 2020

In [30]:
frame2['Faltas'] = 8

In [31]:
frame2

item    Alunos Disciplinas  Notas   Ano  Faltas
id
0        Pedro  Matemática      8  2020       8
1     Henrique   Português     10  2020       8
2       Manoel      Física      5  2020       8
3        Fabio     Química      3  2020       8

As you can see from this result, there is a new column called new with the value  
within 12 replicated for each of its elements.  
If, however, you want to update the contents of a column, you have to use an array.

In [32]:
frame2['Faltas'] = [8,14,5,0]

In [33]:
frame2

item    Alunos Disciplinas  Notas   Ano  Faltas
id
0        Pedro  Matemática      8  2020       8
1     Henrique   Português     10  2020      14
2       Manoel      Física      5  2020       5
3        Fabio     Química      3  2020       0

You can follow a similar approach if you want to update an entire column, for  
example, by using the np.arange() function to update the values of a column with a  
predetermined sequence.  
The columns of a dataframe can also be created by assigning a series to one of them,  
for example by specifying a series containing an increasing series of values through the  
use of np.arange().

In [34]:
numeros = pd.Series(np.arange(4))

In [35]:
frame2['Numero'] = numeros

In [36]:
frame2

item    Alunos Disciplinas  Notas   Ano  Faltas  Numero
id
0        Pedro  Matemática      8  2020       8       0
1     Henrique   Português     10  2020      14       1
2       Manoel      Física      5  2020       5       2
3        Fabio     Química      3  2020       0       3

In [40]:
# Transformando uma coluna em índice.

print(frame2.set_index('Alunos'))

item     Disciplinas  Notas   Ano  Faltas  Numero
Alunos
Pedro     Matemática      8  2020       8       0
Henrique   Português     10  2020      14       1
Manoel        Física      5  2020       5       2
Fabio        Química      3  2020       0       3

In [38]:
frame2.describe()

item       Notas     Ano    Faltas    Numero
count   4.000000     4.0   4.00000  4.000000
mean    6.500000  2020.0   6.75000  1.500000
std     3.109126     0.0   5.85235  1.290994
min     3.000000  2020.0   0.00000  0.000000
25%     4.500000  2020.0   3.75000  0.750000
50%     6.500000  2020.0   6.50000  1.500000
75%     8.500000  2020.0   9.50000  2.250000
max    10.000000  2020.0  14.00000  3.000000

In [41]:
print(frame2.head())

item    Alunos Disciplinas  Notas   Ano  Faltas  Numero
id
0        Pedro  Matemática      8  2020       8       0
1     Henrique   Português     10  2020      14       1
2       Manoel      Física      5  2020       5       2
3        Fabio     Química      3  2020       0       3

# Essential Functionality
In this section, I’ll walk you through the fundamental mechanics of interacting with  
the data contained in a Series or DataFrame. Upcoming chapters will delve more deeply  
into data analysis and manipulation topics using pandas. This book is not intended to  
serve as exhaustive documentation for the pandas library; I instead focus on the most  
important features, leaving the less common (that is, more esoteric) things for you to  
explore on your own.

# Reindexing
A critical method on pandas objects is reindex, which means to create a new object  
with the data conformed to a new index.

In [1]:
from pandas import Series

In [2]:
obj = Series([2.5,3.4,10.2,13.2], index=['d','b','a','c'])

In [3]:
obj

d     2.5
b     3.4
a    10.2
c    13.2
dtype: float64

Calling reindex on this Series rearranges the data according to the new index, introducing missing values if any index   values were not already present:

In [4]:
obj2 = obj.reindex(['a','b','c','d','e'])

In [5]:
obj2

a    10.2
b     3.4
c    13.2
d     2.5
e     NaN
dtype: float64

For ordered data like time series, it may be desirable to do some interpolation or filling  
of values when reindexing. The method option allows us to do this, using a method such  
as ffill which forward fills the values:

In [6]:
obj3 = Series(['blue','purple','yellow'], index=[0,2,4])

In [7]:
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [25]:
from pandas import DataFrame
import numpy as np

In [12]:
frame = DataFrame(np.arange(9).reshape((3,3)),index=['a','b','c'], columns=['Ohio','Texas','California'])

In [13]:
frame

   Ohio  Texas  California
a     0      1           2
b     3      4           5
c     6      7           8

# Dropping entries from an axis
Dropping one or more entries from an axis is easy if you have an index array or list  
without those entries. As that can require a bit of munging and set logic, the drop  
method will return a new object with the indicated value or values deleted from an axis:

In [14]:
obj = Series(np.arange(5.), index=['a','b','c','d','e'])

In [16]:
new_obj = obj.drop('c')

In [17]:
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [18]:
obj.drop(['d','c'])

a    0.0
b    1.0
e    4.0
dtype: float64

With DataFrame, index values can be deleted from either axis:

In [19]:
data = DataFrame(np.arange(16).reshape((4,4)), index=['Ohio','Colorado','Utah','New York'], columns=['one','two','three','four'])

In [20]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [21]:
data.drop(['Colorado','Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [22]:
data.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [23]:
data.drop(['three', 'four'], axis=1)

          one  two
Ohio        0    1
Colorado    4    5
Utah        8    9
New York   12   13

# Time Series

In [30]:
import pandas as pd
# Criando um range de datas com frequência de segundos.
# Uma série temporal é um data frame com apenas uma coluna.
# Onde o S é o segundos.
rng = pd.date_range('1/1/2018', periods = 50, freq = 'S')

In [28]:
ts = pd.Series(np.random.randint(0,500,len(rng)), index = rng)

In [29]:
ts

2018-01-01 00:00:00    368
2018-01-01 00:00:01    170
2018-01-01 00:00:02    181
2018-01-01 00:00:03     96
2018-01-01 00:00:04     77
2018-01-01 00:00:05    294
2018-01-01 00:00:06    414
2018-01-01 00:00:07    189
2018-01-01 00:00:08     13
2018-01-01 00:00:09    346
2018-01-01 00:00:10    200
2018-01-01 00:00:11    182
2018-01-01 00:00:12    293
2018-01-01 00:00:13    199
2018-01-01 00:00:14     70
2018-01-01 00:00:15     55
2018-01-01 00:00:16    466
2018-01-01 00:00:17    101
2018-01-01 00:00:18    121
2018-01-01 00:00:19    415
2018-01-01 00:00:20    116
2018-01-01 00:00:21     93
2018-01-01 00:00:22    249
2018-01-01 00:00:23    373
2018-01-01 00:00:24     83
2018-01-01 00:00:25    182
2018-01-01 00:00:26    145
2018-01-01 00:00:27    151
2018-01-01 00:00:28    476
2018-01-01 00:00:29     71
2018-01-01 00:00:30     20
2018-01-01 00:00:31     78
2018-01-01 00:00:32    275
2018-01-01 00:00:33    472
2018-01-01 00:00:34      2
2018-01-01 00:00:35    280
2018-01-01 00:00:36     73
2018-01-01 00:00:37     62
2018-01-01 00:00:38    117
2018-01-01 00:00:39    469
2018-01-01 00:00:40    241
2018-01-01 00:00:41    267
2018-01-01 00:00:42    166
2018-01-01 00:00:43    301
2018-01-01 00:00:44      1
2018-01-01 00:00:45    182
2018-01-01 00:00:46     58
2018-01-01 00:00:47     70
2018-01-01 00:00:48     44
2018-01-01 00:00:49      8
Freq: S, dtype: int32

In [32]:
# Criando um range de datas com frequência de meses
rng = pd.date_range('1/1/2020',periods=5, freq='M')

In [33]:
ts = pd.Series(np.random.randint(0, 500,len(rng)), index = rng)

In [34]:
ts

2020-01-31    427
2020-02-29    457
2020-03-31     17
2020-04-30    307
2020-05-31    201
Freq: M, dtype: int32

# Arithmetic methods with fill values
In arithmetic operations between differently-indexed objects, you might want to fill  
with a special value, like 0, when an axis label is found in one object but not the other:

In [3]:
from pandas import DataFrame
import numpy as np

In [4]:
df1 = DataFrame(np.arange(12.).reshape((3,4)), columns=list('abcd'))

In [5]:
df2 = DataFrame(np.arange(20.).reshape((4,5)), columns=list('abcde'))

In [6]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [7]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

Adding these together results in NA values in the locations that don’t overlap:

In [8]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

Using the add method on df1, I pass df2 and an argument to fill_value:

In [9]:
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

Relatedly, when reindexing a Series or DataFrame, you can also specify a different fill  
value:

In [10]:
df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

# Operations between DataFrame and Series
As with NumPy arrays, arithmetic between DataFrame and Series is well-defined. First,  
as a motivating example, consider the difference between a 2D array and one of its rows:

In [11]:
arr = np.arange(12.).reshape((3,4))

In [12]:
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [13]:
arr[0]

array([0., 1., 2., 3.])

In [14]:
arr - arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

Function application and mapping  
NumPy ufuncs (element-wise array methods) work fine with pandas objects:

In [15]:
frame = DataFrame(np.random.randn(4,3), columns=list('bde'), index=['Utah','Ohio','Texas','Oregon'])

In [16]:
frame

               b         d         e
Utah   -0.541424  1.336363  0.587683
Ohio    1.889540 -0.249204  0.367665
Texas   0.453559 -0.560569 -1.482125
Oregon  0.157276 -0.445406  0.555935

In [17]:
np.abs(frame)

               b         d         e
Utah    0.541424  1.336363  0.587683
Ohio    1.889540  0.249204  0.367665
Texas   0.453559  0.560569  1.482125
Oregon  0.157276  0.445406  0.555935

Another frequent operation is applying a function on 1D arrays to each column or row.  
DataFrame’s apply method does exactly this:

In [19]:
f = lambda x: x.max() - x.min()

In [20]:
f

In [21]:
frame.apply(f)

b    2.430965
d    1.896932
e    2.069808
dtype: float64

In [22]:
frame.apply(f, axis=1)

Utah      1.877788
Ohio      2.138745
Texas     1.935684
Oregon    1.001341
dtype: float64

Many of the most common array statistics (like sum and mean) are DataFrame methods,  
so using apply is not necessary.

The function passed to apply need not return a scala value, it can also return a Series with multiple values:

# Sorting and ranking
Sorting a data set by some criterion is another important built-in operation. To sort  
lexicographically by row or column index, use the sort_index method, which returns  
a new, sorted object:

In [24]:
from pandas import Series
obj = Series(range(4), index=['d','a','b','c'])

In [25]:
obj

d    0
a    1
b    2
c    3
dtype: int64

In [26]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

With a DataFrame, you can sort by index on either axis:

In [31]:
frame = DataFrame(np.arange(8).reshape((2,4)), index=['three','one'], columns=['d','a','c','b'])

In [32]:
frame

       d  a  c  b
three  0  1  2  3
one    4  5  6  7

In [33]:
frame.sort_index()

       d  a  c  b
one    4  5  6  7
three  0  1  2  3

In [34]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  3  2  0
one    5  7  6  4

The data is sorted in ascending order by default, but can be sorted in descending order,  
too:

In [35]:
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  2  3  1
one    4  6  7  5

To sort a Series by its values, use its order method:

In [36]:
obj = Series([4,7,-3,2])

In [37]:
obj.order()

AttributeError: 'Series' object has no attribute 'order'

Any missing values are sorted to the end of the Series by default:

In [38]:
obj = Series([4, np.nan, 7,np.nan, -3,2])

In [41]:
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [40]:
dir(obj)

['T',
 '_AXIS_ALIASES',
 '_AXIS_IALIASES',
 '_AXIS_LEN',
 '_AXIS_NAMES',
 '_AXIS_NUMBERS',
 '_AXIS_ORDERS',
 '_AXIS_REVERSED',
 '_HANDLED_TYPES',
 '__abs__',
 '__add__',
 '__and__',
 '__annotations__',
 '__array__',
 '__array_priority__',
 '__array_ufunc__',
 '__array_wrap__',
 '__bool__',
 '__class__',
 '__contains__',
 '__copy__',
 '__deepcopy__',
 '__delattr__',
 '__delitem__',
 '__dict__',
 '__dir__',
 '__div__',
 '__divmod__',
 '__doc__',
 '__eq__',
 '__finalize__',
 '__float__',
 '__floordiv__',
 '__format__',
 '__ge__',
 '__getattr__',
 '__getattribute__',
 '__getitem__',
 '__getstate__',
 '__gt__',
 '__hash__',
 '__iadd__',
 '__iand__',
 '__ifloordiv__',
 '__imod__',
 '__imul__',
 '__init__',
 '__init_subclass__',
 '__int__',
 '__invert__',
 '__ior__',
 '__ipow__',
 '__isub__',
 '__iter__',
 '__itruediv__',
 '__ixor__',
 '__le__',
 '__len__',
 '__long__',
 '__lt__',
 '__matmul__',
 '__mod__',
 '__module__',
 '__mul__',
 '__ne__',
 '__neg__',
 '__new__',
 '__nonzero__',
 '__or__',
 '__pos__',
 '__pow__',
 '__radd__',
 '__rand__',
 '__rdiv__',
 '__rdivmod__',
 '__reduce__',
 '__reduce_ex__',
 '__repr__',
 '__rfloordiv__',
 '__rmatmul__',
 '__rmod__',
 '__rmul__',
 '__ror__',
 '__round__',
 '__rpow__',
 '__rsub__',
 '__rtruediv__',
 '__rxor__',
 '__setattr__',
 '__setitem__',
 '__setstate__',
 '__sizeof__',
 '__str__',
 '__sub__',
 '__subclasshook__',
 '__truediv__',
 '__weakref__',
 '__xor__',
 '_accessors',
 '_add_numeric_operations',
 '_add_series_or_dataframe_operations',
 '_agg_by_level',
 '_agg_examples_doc',
 '_agg_see_also_doc',
 '_aggregate',
 '_aggregate_multiple_funcs',
 '_align_frame',
 '_align_series',
 '_binop',
 '_box_item_values',
 '_builtin_table',
 '_can_hold_na',
 '_check_inplace_setting',
 '_check_is_chained_assignment_possible',
 '_check_label_or_level_ambiguity',
 '_check_setitem_copy',
 '_clear_item_cache',
 '_clip_with_one_bound',
 '_clip_with_scalar',
 '_consolidate',
 '_consolidate_inplace',
 '_construct_axes_dict',
 '_construct_axes_dict_from',
 '_construct_axes_from_arguments',
 '_constructor',
 '_constructor_expanddim',
 '_constructor_sliced',
 '_convert',
 '_convert_dtypes',
 '_create_indexer',
 '_cython_table',
 '_deprecations',
 '_dir_additions',
 '_dir_deletions',
 '_drop_axis',
 '_drop_labels_or_levels',
 '_find_valid_index',
 '_from_axes',
 '_get_axis',
 '_get_axis_name',
 '_get_axis_number',
 '_get_axis_resolvers',
 '_get_block_manager_axis',
 '_get_bool_data',
 '_get_cacher',
 '_get_cleaned_column_resolvers',
 '_get_cython_func',
 '_get_index_resolvers',
 '_get_item_cache',
 '_get_label_or_level_values',
 '_get_numeric_data',
 '_get_value',
 '_get_values',
 '_get_values_tuple',
 '_get_with',
 '_gotitem',
 '_iget_item_cache',
 '_index',
 '_indexed_same',
 '_info_axis',
 '_info_axis_name',
 '_info_axis_number',
 '_init_dict',
 '_init_mgr',
 '_internal_get_values',
 '_internal_names',
 '_internal_names_set',
 '_is_builtin_func',
 '_is_cached',
 '_is_copy',
 '_is_datelike_mixed_type',
 '_is_label_or_level_reference',
 '_is_label_reference',
 '_is_level_reference',
 '_is_mixed_type',
 '_is_numeric_mixed_type',
 '_is_view',
 '_ix',
 '_ixs',
 '_map_values',
 '_maybe_cache_changed',
 '_maybe_update_cacher',
 '_metadata',
 '_ndarray_values',
 '_needs_reindex_multi',
 '_obj_with_exclusions',
 '_protect_consolidate',
 '_reduce',
 '_reindex_axes',
 '_reindex_indexer',
 '_reindex_multi',
 '_reindex_with_indexers',
 '_repr_data_resource_',
 '_repr_latex_',
 '_reset_cache',
 '_reset_cacher',
 '_selected_obj',
 '_selection',
 '_selection_list',
 '_selection_name',
 '_set_as_cached',
 '_set_axis',
 '_set_axis_name',
 '_set_is_copy',
 '_set_item',
 '_set_labels',
 '_set_name',
 '_set_subtyp',
 '_set_value',
 '_set_values',
 '_set_with',
 '_set_with_engine',
 '_setup_axes',
 '_slice',
 '_stat_axis',
 '_stat_axis_name',
 '_stat_axis_number',
 '_take_with_is_copy',
 '_to_dict_of_blocks',
 '_try_aggregate_string_function',
 '_typ',
 '_unpickle_series_compat',
 '_update_inplace',
 '_validate_dtype',
 '_values',
 '_where',
 '_xs',
 'abs',
 'add',
 'add_prefix',
 'add_suffix',
 'agg',
 'aggregate',
 'align',
 'all',
 'any',
 'append',
 'apply',
 'argmax',
 'argmin',
 'argsort',
 'array',
 'asfreq',
 'asof',
 'astype',
 'at',
 'at_time',
 'attrs',
 'autocorr',
 'axes',
 'between',
 'between_time',
 'bfill',
 'bool',
 'clip',
 'combine',
 'combine_first',
 'convert_dtypes',
 'copy',
 'corr',
 'count',
 'cov',
 'cummax',
 'cummin',
 'cumprod',
 'cumsum',
 'describe',
 'diff',
 'div',
 'divide',
 'divmod',
 'dot',
 'drop',
 'drop_duplicates',
 'droplevel',
 'dropna',
 'dtype',
 'dtypes',
 'duplicated',
 'empty',
 'eq',
 'equals',
 'ewm',
 'expanding',
 'explode',
 'factorize',
 'ffill',
 'fillna',
 'filter',
 'first',
 'first_valid_index',
 'floordiv',
 'ge',
 'get',
 'groupby',
 'gt',
 'hasnans',
 'head',
 'hist',
 'iat',
 'idxmax',
 'idxmin',
 'iloc',
 'index',
 'infer_objects',
 'interpolate',
 'is_monotonic',
 'is_monotonic_decreasing',
 'is_monotonic_increasing',
 'is_unique',
 'isin',
 'isna',
 'isnull',
 'item',
 'items',
 'iteritems',
 'keys',
 'kurt',
 'kurtosis',
 'last',
 'last_valid_index',
 'le',
 'loc',
 'lt',
 'mad',
 'map',
 'mask',
 'max',
 'mean',
 'median',
 'memory_usage',
 'min',
 'mod',
 'mode',
 'mul',
 'multiply',
 'name',
 'nbytes',
 'ndim',
 'ne',
 'nlargest',
 'notna',
 'notnull',
 'nsmallest',
 'nunique',
 'pct_change',
 'pipe',
 'plot',
 'pop',
 'pow',
 'prod',
 'product',
 'quantile',
 'radd',
 'rank',
 'ravel',
 'rdiv',
 'rdivmod',
 'reindex',
 'reindex_like',
 'rename',
 'rename_axis',
 'reorder_levels',
 'repeat',
 'replace',
 'resample',
 'reset_index',
 'rfloordiv',
 'rmod',
 'rmul',
 'rolling',
 'round',
 'rpow',
 'rsub',
 'rtruediv',
 'sample',
 'searchsorted',
 'sem',
 'set_axis',
 'shape',
 'shift',
 'size',
 'skew',
 'slice_shift',
 'sort_index',
 'sort_values',
 'squeeze',
 'std',
 'sub',
 'subtract',
 'sum',
 'swapaxes',
 'swaplevel',
 'tail',
 'take',
 'to_clipboard',
 'to_csv',
 'to_dict',
 'to_excel',
 'to_frame',
 'to_hdf',
 'to_json',
 'to_latex',
 'to_list',
 'to_markdown',
 'to_numpy',
 'to_period',
 'to_pickle',
 'to_sql',
 'to_string',
 'to_timestamp',
 'to_xarray',
 'transform',
 'transpose',
 'truediv',
 'truncate',
 'tshift',
 'tz_convert',
 'tz_localize',
 'unique',
 'unstack',
 'update',
 'value_counts',
 'values',
 'var',
 'view',
 'where',
 'xs']

In [45]:
frame = DataFrame({'b':[4,7,-3,2], 'a':[0,1,0,1]})

In [46]:
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [48]:
frame.sort_index(by='b')

TypeError: sort_index() got an unexpected keyword argument 'by'

In [49]:
obj = Series([7,-5,7,4,2,0])

In [50]:
obj.rank()

0    5.5
1    1.0
2    5.5
3    4.0
4    3.0
5    2.0
dtype: float64

Ranks can also be assigned according to the order they’re observed in the data:

In [51]:
obj.rank(method='first')

0    5.0
1    1.0
2    6.0
3    4.0
4    3.0
5    2.0
dtype: float64

Naturally, you can rank in descending order, too:

In [52]:
obj.rank(ascending=False, method='max')

0    2.0
1    6.0
2    2.0
3    3.0
4    4.0
5    5.0
dtype: float64

# Axis indexes with duplicate values
Up until now all of the examples I’ve showed you have had unique axis labels (index  
values). While many pandas functions (like reindex) require that the labels be unique,  
it’s not mandatory. Let’s consider a small Series with duplicate indices:

In [2]:
from pandas import Series

In [3]:
obj = Series(range(5), index=['a','a','b','b','c'])

In [4]:
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

The index’s is_unique property can tell you whether its values are unique or not:

In [5]:
obj.index.is_unique

False

In [6]:
obj['a']

a    0
a    1
dtype: int64

In [7]:
obj['b']

b    2
b    3
dtype: int64

The same logic extends to indexing rows in a DataFrame:

In [8]:
df = DataFrame(np.random.randn(4,3), index=['a','a','b','b'])

In [15]:
df.index

Index(['a', 'a', 'b', 'b'], dtype='object')

In [16]:
df.index['a']

IndexError: only integers, slices (`:`), ellipsis (`...`), numpy.newaxis (`None`) and integer or boolean arrays are valid indices

In [13]:
dir(df)

['T',
 '_AXIS_ALIASES',
 '_AXIS_IALIASES',
 '_AXIS_LEN',
 '_AXIS_NAMES',
 '_AXIS_NUMBERS',
 '_AXIS_ORDERS',
 '_AXIS_REVERSED',
 '__abs__',
 '__add__',
 '__and__',
 '__annotations__',
 '__array__',
 '__array_priority__',
 '__array_wrap__',
 '__bool__',
 '__class__',
 '__contains__',
 '__copy__',
 '__deepcopy__',
 '__delattr__',
 '__delitem__',
 '__dict__',
 '__dir__',
 '__div__',
 '__doc__',
 '__eq__',
 '__finalize__',
 '__floordiv__',
 '__format__',
 '__ge__',
 '__getattr__',
 '__getattribute__',
 '__getitem__',
 '__getstate__',
 '__gt__',
 '__hash__',
 '__iadd__',
 '__iand__',
 '__ifloordiv__',
 '__imod__',
 '__imul__',
 '__init__',
 '__init_subclass__',
 '__invert__',
 '__ior__',
 '__ipow__',
 '__isub__',
 '__iter__',
 '__itruediv__',
 '__ixor__',
 '__le__',
 '__len__',
 '__lt__',
 '__matmul__',
 '__mod__',
 '__module__',
 '__mul__',
 '__ne__',
 '__neg__',
 '__new__',
 '__nonzero__',
 '__or__',
 '__pos__',
 '__pow__',
 '__radd__',
 '__rand__',
 '__rdiv__',
 '__reduce__',
 '__reduce_ex__',
 '__repr__',
 '__rfloordiv__',
 '__rmatmul__',
 '__rmod__',
 '__rmul__',
 '__ror__',
 '__round__',
 '__rpow__',
 '__rsub__',
 '__rtruediv__',
 '__rxor__',
 '__setattr__',
 '__setitem__',
 '__setstate__',
 '__sizeof__',
 '__str__',
 '__sub__',
 '__subclasshook__',
 '__truediv__',
 '__weakref__',
 '__xor__',
 '_accessors',
 '_add_numeric_operations',
 '_add_series_or_dataframe_operations',
 '_agg_by_level',
 '_agg_examples_doc',
 '_agg_summary_and_see_also_doc',
 '_aggregate',
 '_aggregate_multiple_funcs',
 '_align_frame',
 '_align_series',
 '_box_col_values',
 '_box_item_values',
 '_builtin_table',
 '_check_inplace_setting',
 '_check_is_chained_assignment_possible',
 '_check_label_or_level_ambiguity',
 '_check_setitem_copy',
 '_clear_item_cache',
 '_clip_with_one_bound',
 '_clip_with_scalar',
 '_combine_frame',
 '_combine_match_index',
 '_consolidate',
 '_consolidate_inplace',
 '_construct_axes_dict',
 '_construct_axes_dict_from',
 '_construct_axes_from_arguments',
 '_construct_result',
 '_constructor',
 '_constructor_expanddim',
 '_constructor_sliced',
 '_convert',
 '_count_level',
 '_create_indexer',
 '_cython_table',
 '_deprecations',
 '_dir_additions',
 '_dir_deletions',
 '_drop_axis',
 '_drop_labels_or_levels',
 '_ensure_valid_index',
 '_find_valid_index',
 '_from_arrays',
 '_from_axes',
 '_get_agg_axis',
 '_get_axis',
 '_get_axis_name',
 '_get_axis_number',
 '_get_axis_resolvers',
 '_get_block_manager_axis',
 '_get_bool_data',
 '_get_cacher',
 '_get_cleaned_column_resolvers',
 '_get_cython_func',
 '_get_index_resolvers',
 '_get_item_cache',
 '_get_label_or_level_values',
 '_get_numeric_data',
 '_get_value',
 '_get_values',
 '_getitem_bool_array',
 '_getitem_multilevel',
 '_gotitem',
 '_iget_item_cache',
 '_indexed_same',
 '_info_axis',
 '_info_axis_name',
 '_info_axis_number',
 '_info_repr',
 '_init_mgr',
 '_internal_get_values',
 '_internal_names',
 '_internal_names_set',
 '_is_builtin_func',
 '_is_cached',
 '_is_copy',
 '_is_datelike_mixed_type',
 '_is_homogeneous_type',
 '_is_label_or_level_reference',
 '_is_label_reference',
 '_is_level_reference',
 '_is_mixed_type',
 '_is_numeric_mixed_type',
 '_is_view',
 '_ix',
 '_ixs',
 '_join_compat',
 '_maybe_cache_changed',
 '_maybe_update_cacher',
 '_metadata',
 '_needs_reindex_multi',
 '_obj_with_exclusions',
 '_protect_consolidate',
 '_reduce',
 '_reindex_axes',
 '_reindex_columns',
 '_reindex_index',
 '_reindex_multi',
 '_reindex_with_indexers',
 '_repr_data_resource_',
 '_repr_fits_horizontal_',
 '_repr_fits_vertical_',
 '_repr_html_',
 '_repr_latex_',
 '_reset_cache',
 '_reset_cacher',
 '_sanitize_column',
 '_selected_obj',
 '_selection',
 '_selection_list',
 '_selection_name',
 '_series',
 '_set_as_cached',
 '_set_axis',
 '_set_axis_name',
 '_set_is_copy',
 '_set_item',
 '_set_value',
 '_setitem_array',
 '_setitem_frame',
 '_setitem_slice',
 '_setup_axes',
 '_slice',
 '_stat_axis',
 '_stat_axis_name',
 '_stat_axis_number',
 '_take_with_is_copy',
 '_to_dict_of_blocks',
 '_try_aggregate_string_function',
 '_typ',
 '_update_inplace',
 '_validate_dtype',
 '_values',
 '_where',
 '_xs',
 'abs',
 'add',
 'add_prefix',
 'add_suffix',
 'agg',
 'aggregate',
 'align',
 'all',
 'any',
 'append',
 'apply',
 'applymap',
 'asfreq',
 'asof',
 'assign',
 'astype',
 'at',
 'at_time',
 'attrs',
 'axes',
 'between_time',
 'bfill',
 'bool',
 'boxplot',
 'clip',
 'columns',
 'combine',
 'combine_first',
 'convert_dtypes',
 'copy',
 'corr',
 'corrwith',
 'count',
 'cov',
 'cummax',
 'cummin',
 'cumprod',
 'cumsum',
 'describe',
 'diff',
 'div',
 'divide',
 'dot',
 'drop',
 'drop_duplicates',
 'droplevel',
 'dropna',
 'dtypes',
 'duplicated',
 'empty',
 'eq',
 'equals',
 'eval',
 'ewm',
 'expanding',
 'explode',
 'ffill',
 'fillna',
 'filter',
 'first',
 'first_valid_index',
 'floordiv',
 'from_dict',
 'from_records',
 'ge',
 'get',
 'groupby',
 'gt',
 'head',
 'hist',
 'iat',
 'idxmax',
 'idxmin',
 'iloc',
 'index',
 'infer_objects',
 'info',
 'insert',
 'interpolate',
 'isin',
 'isna',
 'isnull',
 'items',
 'iteritems',
 'iterrows',
 'itertuples',
 'join',
 'keys',
 'kurt',
 'kurtosis',
 'last',
 'last_valid_index',
 'le',
 'loc',
 'lookup',
 'lt',
 'mad',
 'mask',
 'max',
 'mean',
 'median',
 'melt',
 'memory_usage',
 'merge',
 'min',
 'mod',
 'mode',
 'mul',
 'multiply',
 'ndim',
 'ne',
 'nlargest',
 'notna',
 'notnull',
 'nsmallest',
 'nunique',
 'pct_change',
 'pipe',
 'pivot',
 'pivot_table',
 'plot',
 'pop',
 'pow',
 'prod',
 'product',
 'quantile',
 'query',
 'radd',
 'rank',
 'rdiv',
 'reindex',
 'reindex_like',
 'rename',
 'rename_axis',
 'reorder_levels',
 'replace',
 'resample',
 'reset_index',
 'rfloordiv',
 'rmod',
 'rmul',
 'rolling',
 'round',
 'rpow',
 'rsub',
 'rtruediv',
 'sample',
 'select_dtypes',
 'sem',
 'set_axis',
 'set_index',
 'shape',
 'shift',
 'size',
 'skew',
 'slice_shift',
 'sort_index',
 'sort_values',
 'squeeze',
 'stack',
 'std',
 'style',
 'sub',
 'subtract',
 'sum',
 'swapaxes',
 'swaplevel',
 'tail',
 'take',
 'to_clipboard',
 'to_csv',
 'to_dict',
 'to_excel',
 'to_feather',
 'to_gbq',
 'to_hdf',
 'to_html',
 'to_json',
 'to_latex',
 'to_markdown',
 'to_numpy',
 'to_parquet',
 'to_period',
 'to_pickle',
 'to_records',
 'to_sql',
 'to_stata',
 'to_string',
 'to_timestamp',
 'to_xarray',
 'transform',
 'transpose',
 'truediv',
 'truncate',
 'tshift',
 'tz_convert',
 'tz_localize',
 'unstack',
 'update',
 'values',
 'var',
 'where',
 'xs']

# Summarizing and Computing Descriptive Statistics
pandas objects are equipped with a set of common mathematical and statistical methods. Most of these fall into the category  of reductions or summary statistics, methods  
that extract a single value (like the sum or mean) from a Series or a Series of values from  
the rows or columns of a DataFrame. Compared with the equivalent methods of vanilla  
NumPy arrays, they are all built from the ground up to exclude missing data. Consider  
a small DataFrame:

In [17]:
df = DataFrame([[1.4, np.nan],[7.1, -4.5],
              [np.nan, np.nan],[0.75, -1.3]],
               index=['a','b','c','d'],
               columns=['one','two']
              )

In [18]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

Calling DataFrame’s sum method returns a Series containing column sums:

In [19]:
df.sum()

one    9.25
two   -5.80
dtype: float64

Passing axis=1 sums over the rows instead:

In [20]:
df.sum(axis=1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

Some methods, like idxmin and idxmax, return indirect statistics like the index value  
where the minimum or maximum values are attained:

In [24]:
df.idxmax()

one    b
two    d
dtype: object

Other methods are accumulations:

In [25]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

Another type of method is neither a reduction nor an accumulation. describe is one  
such example, producing multiple summary statistics in one shot:

In [26]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [27]:
obj = Series(['a','a','b','c'] * 4)

In [28]:
obj

0     a
1     a
2     b
3     c
4     a
5     a
6     b
7     c
8     a
9     a
10    b
11    c
12    a
13    a
14    b
15    c
dtype: object

In [29]:
obj2 = Series([2,10,12,4] * 3)

In [30]:
obj2

0      2
1     10
2     12
3      4
4      2
5     10
6     12
7      4
8      2
9     10
10    12
11     4
dtype: int64

## Table 5-10. Descriptive and summary statistics
#### Method Description
count Number of non-NA values  
describe Compute set of summary statistics for Series or each DataFrame column  
min, max Compute minimum and maximum values  
argmin, argmax Compute index locations (integers) at which minimum or maximum value obtained, respectively  
idxmin, idxmax Compute index values at which minimum or maximum value obtained, respectively  
quantile Compute sample quantile ranging from 0 to 1  
sum Sum of values  
mean Mean of values  
median Arithmetic median (50% quantile) of values  
mad Mean absolute deviation from mean value  
var Sample variance of values  
std Sample standard deviation of values  
skew Sample skewness (3rd moment) of values  
kurt Sample kurtosis (4th moment) of values  
cumsum Cumulative sum of values  
cummin, cummax Cumulative minimum or maximum of values, respectively  
cumprod Cumulative product of values  
diff Compute 1st arithmetic difference (useful for time series)  
pct_change Compute percent changes

# Correlation and Covariance
Some summary statistics, like correlation and covariance, are computed from pairs of  
arguments. Let’s consider some DataFrames of stock prices and volumes obtained from  
Yahoo! Finance:

In [40]:
!pip install pandas_datareader

Collecting pandas_datareader
  Downloading pandas_datareader-0.8.1-py2.py3-none-any.whl (107 kB)
Requirement already satisfied: pandas>=0.21 in c:\users\ferna\anaconda3\lib\site-packages (from pandas_datareader) (1.0.3)
Requirement already satisfied: requests>=2.3.0 in c:\users\ferna\anaconda3\lib\site-packages (from pandas_datareader) (2.23.0)
Requirement already satisfied: lxml in c:\users\ferna\anaconda3\lib\site-packages (from pandas_datareader) (4.5.0)
Requirement already satisfied: pytz>=2017.2 in c:\users\ferna\anaconda3\lib\site-packages (from pandas>=0.21->pandas_datareader) (2019.3)
Requirement already satisfied: numpy>=1.13.3 in c:\users\ferna\anaconda3\lib\site-packages (from pandas>=0.21->pandas_datareader) (1.18.1)
Requirement already satisfied: python-dateutil>=2.6.1 in c:\users\ferna\anaconda3\lib\site-packages (from pandas>=0.21->pandas_datareader) (2.8.1)
Requirement already satisfied: certifi>=2017.4.17 in c:\users\ferna\anaconda3\lib\site-packages (from requests>=2.3.0->pandas_datareader) (2020.4.5.1)
Requirement already satisfied: chardet<4,>=3.0.2 in c:\users\ferna\anaconda3\lib\site-packages (from requests>=2.3.0->pandas_datareader) (3.0.4)
Requirement already satisfied: urllib3!=1.25.0,!=1.25.1,<1.26,>=1.21.1 in c:\users\ferna\anaconda3\lib\site-packages (from requests>=2.3.0->pandas_datareader) (1.25.8)
Requirement already satisfied: idna<3,>=2.5 in c:\users\ferna\anaconda3\lib\site-packages (from requests>=2.3.0->pandas_datareader) (2.9)
Requirement already satisfied: six>=1.5 in c:\users\ferna\anaconda3\lib\site-packages (from python-dateutil>=2.6.1->pandas>=0.21->pandas_datareader) (1.14.0)
Installing collected packages: pandas-datareader
Successfully installed pandas-datareader-0.8.1

In [41]:
import pandas_datareader as web

C:\Users\ferna\Anaconda3\lib\site-packages\pandas_datareader\compat\__init__.py:7: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  from pandas.util.testing import assert_frame_equal

In [42]:
all_data = {}
for ticker in ['AAPL','IBM','MSFT','GOOG']:
    all_data[ticker] = web.get_data_yahoo(ticker, '1/1/2000','1/1/2010')

In [45]:
price = DataFrame({tic: data['Adj Close']
                  for tic, data in all_data.items()})

In [46]:
volume = DataFrame({tic: data['Volume']
                   for tic, data in all_data.items()})

In [47]:
returns = price.pct_change()

In [48]:
returns.tail()

                AAPL       IBM      MSFT      GOOG
Date
2009-12-24  0.034340  0.004385  0.002587  0.011117
2009-12-28  0.012294  0.013326  0.005484  0.007098
2009-12-29 -0.011861 -0.003477  0.007058 -0.005571
2009-12-30  0.012147  0.005461 -0.013699  0.005376
2009-12-31 -0.004299 -0.012597 -0.015504 -0.004416

The corr method of Series computes the correlation of the overlapping, non-NA,  
aligned-by-index values in two Series. Relatedly, cov computes the covariance:

In [49]:
returns.MSFT.corr(returns.IBM)

0.49597950854804995

In [50]:
returns.MSFT.cov(returns.IBM)

0.00021595760356909685

DataFrame’s corr and cov methods, on the other hand, return a full correlation or  
covariance matrix as a DataFrame, respectively:

In [51]:
returns.corr()

          AAPL       IBM      MSFT      GOOG
AAPL  1.000000  0.410012  0.424305  0.470676
IBM   0.410012  1.000000  0.495980  0.390689
MSFT  0.424305  0.495980  1.000000  0.443586
GOOG  0.470676  0.390689  0.443586  1.000000

In [52]:
returns.cov()

          AAPL       IBM      MSFT      GOOG
AAPL  0.001027  0.000252  0.000309  0.000303
IBM   0.000252  0.000367  0.000216  0.000142
MSFT  0.000309  0.000216  0.000516  0.000205
GOOG  0.000303  0.000142  0.000205  0.000580

# Unique Values, Value Counts, and Membership
Another class of related methods extracts information about the values contained in a  
one-dimensional Series. To illustrate these, consider this example:

In [2]:
from pandas import Series

In [3]:
obj = Series(['c','a','d','a','a','b','b','c','c'])

In [4]:
unique = obj.unique()

In [5]:
unique

array(['c', 'a', 'd', 'b'], dtype=object)

The unique values are not necessarily returned in sorted order, but could be sorted after  
the fact if needed (uniques.sort()). Relatedly, value_counts computes a Series containing value frequencies:

In [7]:
unique.sort()

In [8]:
unique

array(['a', 'b', 'c', 'd'], dtype=object)

In [9]:
obj.value_counts()

a    3
c    3
b    2
d    1
dtype: int64

In [11]:
from pandas import DataFrame

In some cases, you may want to compute a histogram on multiple related columns in  
a DataFrame. Here’s an example:

In [12]:
data = DataFrame({
    'Qu1':[1,3,4,3,4],
    'Qu2':[2,3,1,2,3],
    'Qu3':[1,5,2,4,4]
})

In [13]:
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

Passing pandas.value_counts to this DataFrame’s apply function gives:

In [17]:
result = data.apply(pd.value_counts).fillna(0)

In [18]:
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

# Handling Missing Data
Missing data is common in most data analysis applications. One of the goals in designing pandas was to make working with missing data as painless as possible. For example, all of the descriptive statistics on pandas objects exclude missing data as you’ve seen earlier in the chapter.

The built-in Python None value is also treated as NA in object arrays:

In [19]:
string_data[0] = None

NameError: name 'string_data' is not defined

# Filtering Out Missing Data
You have a number of options for filtering out missing data. While doing it by hand is  
always an option, dropna can be very helpful. On a Series, it returns the Series with only  
the non-null data and index values:

In [20]:
from numpy import nan as NA

In [21]:
data = Series([1, NA, 3.5, NA, 7])

In [22]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

Naturally, you could have computed this yourself by boolean indexing:

In [23]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

With DataFrame objects, these are a bit more complex. You may want to drop rows  
or columns which are all NA or just those containing any NAs. dropna by default drops  
any row containing a missing value:

In [24]:
data = DataFrame([[1,6.5,3],[1,NA,NA],[NA,NA,NA],[NA,6.5,3]])

In [25]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [26]:
cleaned = data.dropna()

In [27]:
cleaned

     0    1    2
0  1.0  6.5  3.0

Passing how='all' will only drop rows that are all NA:

In [28]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [29]:
data[4] = NA

In [30]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [31]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [32]:
df = DataFrame(np.random.randn(7,3))

In [33]:
df.ix[:4, 1] = NA; df.ix[:2, 2] = NA

AttributeError: 'DataFrame' object has no attribute 'ix'

In [34]:
dir(DataFrame)

['T',
 '_AXIS_ALIASES',
 '_AXIS_IALIASES',
 '_AXIS_LEN',
 '_AXIS_NAMES',
 '_AXIS_NUMBERS',
 '_AXIS_ORDERS',
 '_AXIS_REVERSED',
 '__abs__',
 '__add__',
 '__and__',
 '__annotations__',
 '__array__',
 '__array_priority__',
 '__array_wrap__',
 '__bool__',
 '__class__',
 '__contains__',
 '__copy__',
 '__deepcopy__',
 '__delattr__',
 '__delitem__',
 '__dict__',
 '__dir__',
 '__div__',
 '__doc__',
 '__eq__',
 '__finalize__',
 '__floordiv__',
 '__format__',
 '__ge__',
 '__getattr__',
 '__getattribute__',
 '__getitem__',
 '__getstate__',
 '__gt__',
 '__hash__',
 '__iadd__',
 '__iand__',
 '__ifloordiv__',
 '__imod__',
 '__imul__',
 '__init__',
 '__init_subclass__',
 '__invert__',
 '__ior__',
 '__ipow__',
 '__isub__',
 '__iter__',
 '__itruediv__',
 '__ixor__',
 '__le__',
 '__len__',
 '__lt__',
 '__matmul__',
 '__mod__',
 '__module__',
 '__mul__',
 '__ne__',
 '__neg__',
 '__new__',
 '__nonzero__',
 '__or__',
 '__pos__',
 '__pow__',
 '__radd__',
 '__rand__',
 '__rdiv__',
 '__reduce__',
 '__reduce_ex__',
 '__repr__',
 '__rfloordiv__',
 '__rmatmul__',
 '__rmod__',
 '__rmul__',
 '__ror__',
 '__round__',
 '__rpow__',
 '__rsub__',
 '__rtruediv__',
 '__rxor__',
 '__setattr__',
 '__setitem__',
 '__setstate__',
 '__sizeof__',
 '__str__',
 '__sub__',
 '__subclasshook__',
 '__truediv__',
 '__weakref__',
 '__xor__',
 '_accessors',
 '_add_numeric_operations',
 '_add_series_or_dataframe_operations',
 '_agg_by_level',
 '_agg_examples_doc',
 '_agg_summary_and_see_also_doc',
 '_aggregate',
 '_aggregate_multiple_funcs',
 '_align_frame',
 '_align_series',
 '_box_col_values',
 '_box_item_values',
 '_builtin_table',
 '_check_inplace_setting',
 '_check_is_chained_assignment_possible',
 '_check_label_or_level_ambiguity',
 '_check_setitem_copy',
 '_clear_item_cache',
 '_clip_with_one_bound',
 '_clip_with_scalar',
 '_combine_frame',
 '_combine_match_index',
 '_consolidate',
 '_consolidate_inplace',
 '_construct_axes_dict',
 '_construct_axes_dict_from',
 '_construct_axes_from_arguments',
 '_construct_result',
 '_constructor',
 '_constructor_expanddim',
 '_constructor_sliced',
 '_convert',
 '_count_level',
 '_create_indexer',
 '_cython_table',
 '_deprecations',
 '_dir_additions',
 '_dir_deletions',
 '_drop_axis',
 '_drop_labels_or_levels',
 '_ensure_valid_index',
 '_find_valid_index',
 '_from_arrays',
 '_from_axes',
 '_get_agg_axis',
 '_get_axis',
 '_get_axis_name',
 '_get_axis_number',
 '_get_axis_resolvers',
 '_get_block_manager_axis',
 '_get_bool_data',
 '_get_cacher',
 '_get_cleaned_column_resolvers',
 '_get_cython_func',
 '_get_index_resolvers',
 '_get_item_cache',
 '_get_label_or_level_values',
 '_get_numeric_data',
 '_get_value',
 '_get_values',
 '_getitem_bool_array',
 '_getitem_multilevel',
 '_gotitem',
 '_iget_item_cache',
 '_indexed_same',
 '_info_axis',
 '_info_axis_name',
 '_info_axis_number',
 '_info_repr',
 '_init_mgr',
 '_internal_get_values',
 '_internal_names',
 '_internal_names_set',
 '_is_builtin_func',
 '_is_cached',
 '_is_copy',
 '_is_datelike_mixed_type',
 '_is_homogeneous_type',
 '_is_label_or_level_reference',
 '_is_label_reference',
 '_is_level_reference',
 '_is_mixed_type',
 '_is_numeric_mixed_type',
 '_is_view',
 '_ix',
 '_ixs',
 '_join_compat',
 '_maybe_cache_changed',
 '_maybe_update_cacher',
 '_metadata',
 '_needs_reindex_multi',
 '_obj_with_exclusions',
 '_protect_consolidate',
 '_reduce',
 '_reindex_axes',
 '_reindex_columns',
 '_reindex_index',
 '_reindex_multi',
 '_reindex_with_indexers',
 '_repr_data_resource_',
 '_repr_fits_horizontal_',
 '_repr_fits_vertical_',
 '_repr_html_',
 '_repr_latex_',
 '_reset_cache',
 '_reset_cacher',
 '_sanitize_column',
 '_selected_obj',
 '_selection',
 '_selection_list',
 '_selection_name',
 '_series',
 '_set_as_cached',
 '_set_axis',
 '_set_axis_name',
 '_set_is_copy',
 '_set_item',
 '_set_value',
 '_setitem_array',
 '_setitem_frame',
 '_setitem_slice',
 '_setup_axes',
 '_slice',
 '_stat_axis',
 '_stat_axis_name',
 '_stat_axis_number',
 '_take_with_is_copy',
 '_to_dict_of_blocks',
 '_try_aggregate_string_function',
 '_typ',
 '_update_inplace',
 '_validate_dtype',
 '_values',
 '_where',
 '_xs',
 'abs',
 'add',
 'add_prefix',
 'add_suffix',
 'agg',
 'aggregate',
 'align',
 'all',
 'any',
 'append',
 'apply',
 'applymap',
 'asfreq',
 'asof',
 'assign',
 'astype',
 'at',
 'at_time',
 'attrs',
 'axes',
 'between_time',
 'bfill',
 'bool',
 'boxplot',
 'clip',
 'columns',
 'combine',
 'combine_first',
 'convert_dtypes',
 'copy',
 'corr',
 'corrwith',
 'count',
 'cov',
 'cummax',
 'cummin',
 'cumprod',
 'cumsum',
 'describe',
 'diff',
 'div',
 'divide',
 'dot',
 'drop',
 'drop_duplicates',
 'droplevel',
 'dropna',
 'dtypes',
 'duplicated',
 'empty',
 'eq',
 'equals',
 'eval',
 'ewm',
 'expanding',
 'explode',
 'ffill',
 'fillna',
 'filter',
 'first',
 'first_valid_index',
 'floordiv',
 'from_dict',
 'from_records',
 'ge',
 'get',
 'groupby',
 'gt',
 'head',
 'hist',
 'iat',
 'idxmax',
 'idxmin',
 'iloc',
 'index',
 'infer_objects',
 'info',
 'insert',
 'interpolate',
 'isin',
 'isna',
 'isnull',
 'items',
 'iteritems',
 'iterrows',
 'itertuples',
 'join',
 'keys',
 'kurt',
 'kurtosis',
 'last',
 'last_valid_index',
 'le',
 'loc',
 'lookup',
 'lt',
 'mad',
 'mask',
 'max',
 'mean',
 'median',
 'melt',
 'memory_usage',
 'merge',
 'min',
 'mod',
 'mode',
 'mul',
 'multiply',
 'ndim',
 'ne',
 'nlargest',
 'notna',
 'notnull',
 'nsmallest',
 'nunique',
 'pct_change',
 'pipe',
 'pivot',
 'pivot_table',
 'plot',
 'pop',
 'pow',
 'prod',
 'product',
 'quantile',
 'query',
 'radd',
 'rank',
 'rdiv',
 'reindex',
 'reindex_like',
 'rename',
 'rename_axis',
 'reorder_levels',
 'replace',
 'resample',
 'reset_index',
 'rfloordiv',
 'rmod',
 'rmul',
 'rolling',
 'round',
 'rpow',
 'rsub',
 'rtruediv',
 'sample',
 'select_dtypes',
 'sem',
 'set_axis',
 'set_index',
 'shape',
 'shift',
 'size',
 'skew',
 'slice_shift',
 'sort_index',
 'sort_values',
 'sparse',
 'squeeze',
 'stack',
 'std',
 'style',
 'sub',
 'subtract',
 'sum',
 'swapaxes',
 'swaplevel',
 'tail',
 'take',
 'to_clipboard',
 'to_csv',
 'to_dict',
 'to_excel',
 'to_feather',
 'to_gbq',
 'to_hdf',
 'to_html',
 'to_json',
 'to_latex',
 'to_markdown',
 'to_numpy',
 'to_parquet',
 'to_period',
 'to_pickle',
 'to_records',
 'to_sql',
 'to_stata',
 'to_string',
 'to_timestamp',
 'to_xarray',
 'transform',
 'transpose',
 'truediv',
 'truncate',
 'tshift',
 'tz_convert',
 'tz_localize',
 'unstack',
 'update',
 'values',
 'var',
 'where',
 'xs']

# Filling in Missing Data
Rather than filtering out missing data (and potentially discarding other data along with  
it), you may want to fill in the “holes” in any number of ways. For most purposes, the  
fillna method is the workhorse function to use. Calling fillna with a constant replaces  
missing values with that value:

In [35]:
df.fillna(0)

          0         1         2
0 -0.005875  2.023622  1.552501
1 -0.055529  1.118277  1.301898
2  0.719818 -0.441823 -1.392428
3  0.058758 -0.017475  0.876832
4 -0.991413  0.683369  0.901793
5 -0.552221 -0.153933 -2.259841
6 -1.228295  0.600079 -0.909914

# Argument Description
value Scalar value or dict-like object to use to fill missing values  
method Interpolation, by default 'ffill' if function called with no other arguments  
axis Axis to fill on, default axis=0  
inplace Modify the calling object without producing a copy  
limit For forward and backward filling, maximum number of consecutive periods to fill

# Hierarchical Indexing
Hierarchical indexing is an important feature of pandas enabling you to have multiple  
(two or more) index levels on an axis. Somewhat abstractly, it provides a way for you  
to work with higher dimensional data in a lower dimensional form. Let’s start with a  
simple example; create a Series with a list of lists or arrays as the index:

In [36]:
data = Series(np.random.randn(10),
             index=[['a','a','a','b','b','b','c','c','d','d'],[1,2,3,1,2,3,1,2,2,3]])

In [37]:
data

a  1   -0.501642
   2    0.932174
   3    0.901183
b  1    1.019647
   2    2.116351
   3    0.153364
c  1   -1.969389
   2    0.735584
d  2    0.088279
   3   -0.407905
dtype: float64

In [38]:
data.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 2),
            ('b', 3),
            ('c', 1),
            ('c', 2),
            ('d', 2),
            ('d', 3)],
           )

In [39]:
data['b']

1    1.019647
2    2.116351
3    0.153364
dtype: float64

In [40]:
data['b':'c']

b  1    1.019647
   2    2.116351
   3    0.153364
c  1   -1.969389
   2    0.735584
dtype: float64

In [41]:
data['b':'d']

b  1    1.019647
   2    2.116351
   3    0.153364
c  1   -1.969389
   2    0.735584
d  2    0.088279
   3   -0.407905
dtype: float64

Hierarchical indexing plays a critical role in reshaping data and group-based operations  
like forming a pivot table. For example, this data could be rearranged into a DataFrame  
using its unstack method:

In [42]:
data.unstack()

          1         2         3
a -0.501642  0.932174  0.901183
b  1.019647  2.116351  0.153364
c -1.969389  0.735584       NaN
d       NaN  0.088279 -0.407905

The inverse operation of unstack is stack:

In [43]:
data.unstack().stack()

a  1   -0.501642
   2    0.932174
   3    0.901183
b  1    1.019647
   2    2.116351
   3    0.153364
c  1   -1.969389
   2    0.735584
d  2    0.088279
   3   -0.407905
dtype: float64

In [44]:
frame = DataFrame(np.arange(12).reshape((4,3)),
                 index=[['a','a','b','b'],[1,2,1,2]],
                 columns=[['Ohio','Ohio','Colorado'],['Green','Red','Green']])

In [45]:
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

# Unique Values, Value Counts, and Membership
Another class of related methods extracts information about the values contained in a  
one-dimensional Series. To illustrate these, consider this example:

In [1]:
import pandas as pd
import numpy as np

In [4]:
from pandas import Series
obj = Series(['c','a','d','a','a','b','b','c','c'])

In [5]:
unique = obj.unique()

In [6]:
unique

array(['c', 'a', 'd', 'b'], dtype=object)

The unique values are not necessarily returned in sorted order, but could be sorted after  
the fact if needed (uniques.sort()). Relatedly, value_counts computes a Series containing value frequencies:

In [13]:
obj.value_counts()

a    3
c    3
b    2
d    1
dtype: int64

In [11]:
obj.values

array(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'], dtype=object)

In [8]:
dir(obj)

['T',
 '_AXIS_ALIASES',
 '_AXIS_IALIASES',
 '_AXIS_LEN',
 '_AXIS_NAMES',
 '_AXIS_NUMBERS',
 '_AXIS_ORDERS',
 '_AXIS_REVERSED',
 '_HANDLED_TYPES',
 '__abs__',
 '__add__',
 '__and__',
 '__annotations__',
 '__array__',
 '__array_priority__',
 '__array_ufunc__',
 '__array_wrap__',
 '__bool__',
 '__class__',
 '__contains__',
 '__copy__',
 '__deepcopy__',
 '__delattr__',
 '__delitem__',
 '__dict__',
 '__dir__',
 '__div__',
 '__divmod__',
 '__doc__',
 '__eq__',
 '__finalize__',
 '__float__',
 '__floordiv__',
 '__format__',
 '__ge__',
 '__getattr__',
 '__getattribute__',
 '__getitem__',
 '__getstate__',
 '__gt__',
 '__hash__',
 '__iadd__',
 '__iand__',
 '__ifloordiv__',
 '__imod__',
 '__imul__',
 '__init__',
 '__init_subclass__',
 '__int__',
 '__invert__',
 '__ior__',
 '__ipow__',
 '__isub__',
 '__iter__',
 '__itruediv__',
 '__ixor__',
 '__le__',
 '__len__',
 '__long__',
 '__lt__',
 '__matmul__',
 '__mod__',
 '__module__',
 '__mul__',
 '__ne__',
 '__neg__',
 '__new__',
 '__nonzero__',
 '__or__',
 '__pos__',
 '__pow__',
 '__radd__',
 '__rand__',
 '__rdiv__',
 '__rdivmod__',
 '__reduce__',
 '__reduce_ex__',
 '__repr__',
 '__rfloordiv__',
 '__rmatmul__',
 '__rmod__',
 '__rmul__',
 '__ror__',
 '__round__',
 '__rpow__',
 '__rsub__',
 '__rtruediv__',
 '__rxor__',
 '__setattr__',
 '__setitem__',
 '__setstate__',
 '__sizeof__',
 '__str__',
 '__sub__',
 '__subclasshook__',
 '__truediv__',
 '__weakref__',
 '__xor__',
 '_accessors',
 '_add_numeric_operations',
 '_add_series_or_dataframe_operations',
 '_agg_by_level',
 '_agg_examples_doc',
 '_agg_see_also_doc',
 '_aggregate',
 '_aggregate_multiple_funcs',
 '_align_frame',
 '_align_series',
 '_binop',
 '_box_item_values',
 '_builtin_table',
 '_can_hold_na',
 '_check_inplace_setting',
 '_check_is_chained_assignment_possible',
 '_check_label_or_level_ambiguity',
 '_check_setitem_copy',
 '_clear_item_cache',
 '_clip_with_one_bound',
 '_clip_with_scalar',
 '_consolidate',
 '_consolidate_inplace',
 '_construct_axes_dict',
 '_construct_axes_dict_from',
 '_construct_axes_from_arguments',
 '_constructor',
 '_constructor_expanddim',
 '_constructor_sliced',
 '_convert',
 '_convert_dtypes',
 '_create_indexer',
 '_cython_table',
 '_deprecations',
 '_dir_additions',
 '_dir_deletions',
 '_drop_axis',
 '_drop_labels_or_levels',
 '_find_valid_index',
 '_from_axes',
 '_get_axis',
 '_get_axis_name',
 '_get_axis_number',
 '_get_axis_resolvers',
 '_get_block_manager_axis',
 '_get_bool_data',
 '_get_cacher',
 '_get_cleaned_column_resolvers',
 '_get_cython_func',
 '_get_index_resolvers',
 '_get_item_cache',
 '_get_label_or_level_values',
 '_get_numeric_data',
 '_get_value',
 '_get_values',
 '_get_values_tuple',
 '_get_with',
 '_gotitem',
 '_iget_item_cache',
 '_index',
 '_indexed_same',
 '_info_axis',
 '_info_axis_name',
 '_info_axis_number',
 '_init_dict',
 '_init_mgr',
 '_internal_get_values',
 '_internal_names',
 '_internal_names_set',
 '_is_builtin_func',
 '_is_cached',
 '_is_copy',
 '_is_datelike_mixed_type',
 '_is_label_or_level_reference',
 '_is_label_reference',
 '_is_level_reference',
 '_is_mixed_type',
 '_is_numeric_mixed_type',
 '_is_view',
 '_ix',
 '_ixs',
 '_map_values',
 '_maybe_cache_changed',
 '_maybe_update_cacher',
 '_metadata',
 '_ndarray_values',
 '_needs_reindex_multi',
 '_obj_with_exclusions',
 '_protect_consolidate',
 '_reduce',
 '_reindex_axes',
 '_reindex_indexer',
 '_reindex_multi',
 '_reindex_with_indexers',
 '_repr_data_resource_',
 '_repr_latex_',
 '_reset_cache',
 '_reset_cacher',
 '_selected_obj',
 '_selection',
 '_selection_list',
 '_selection_name',
 '_set_as_cached',
 '_set_axis',
 '_set_axis_name',
 '_set_is_copy',
 '_set_item',
 '_set_labels',
 '_set_name',
 '_set_subtyp',
 '_set_value',
 '_set_values',
 '_set_with',
 '_set_with_engine',
 '_setup_axes',
 '_slice',
 '_stat_axis',
 '_stat_axis_name',
 '_stat_axis_number',
 '_take_with_is_copy',
 '_to_dict_of_blocks',
 '_try_aggregate_string_function',
 '_typ',
 '_unpickle_series_compat',
 '_update_inplace',
 '_validate_dtype',
 '_values',
 '_where',
 '_xs',
 'abs',
 'add',
 'add_prefix',
 'add_suffix',
 'agg',
 'aggregate',
 'align',
 'all',
 'any',
 'append',
 'apply',
 'argmax',
 'argmin',
 'argsort',
 'array',
 'asfreq',
 'asof',
 'astype',
 'at',
 'at_time',
 'attrs',
 'autocorr',
 'axes',
 'between',
 'between_time',
 'bfill',
 'bool',
 'clip',
 'combine',
 'combine_first',
 'convert_dtypes',
 'copy',
 'corr',
 'count',
 'cov',
 'cummax',
 'cummin',
 'cumprod',
 'cumsum',
 'describe',
 'diff',
 'div',
 'divide',
 'divmod',
 'dot',
 'drop',
 'drop_duplicates',
 'droplevel',
 'dropna',
 'dtype',
 'dtypes',
 'duplicated',
 'empty',
 'eq',
 'equals',
 'ewm',
 'expanding',
 'explode',
 'factorize',
 'ffill',
 'fillna',
 'filter',
 'first',
 'first_valid_index',
 'floordiv',
 'ge',
 'get',
 'groupby',
 'gt',
 'hasnans',
 'head',
 'hist',
 'iat',
 'idxmax',
 'idxmin',
 'iloc',
 'index',
 'infer_objects',
 'interpolate',
 'is_monotonic',
 'is_monotonic_decreasing',
 'is_monotonic_increasing',
 'is_unique',
 'isin',
 'isna',
 'isnull',
 'item',
 'items',
 'iteritems',
 'keys',
 'kurt',
 'kurtosis',
 'last',
 'last_valid_index',
 'le',
 'loc',
 'lt',
 'mad',
 'map',
 'mask',
 'max',
 'mean',
 'median',
 'memory_usage',
 'min',
 'mod',
 'mode',
 'mul',
 'multiply',
 'name',
 'nbytes',
 'ndim',
 'ne',
 'nlargest',
 'notna',
 'notnull',
 'nsmallest',
 'nunique',
 'pct_change',
 'pipe',
 'plot',
 'pop',
 'pow',
 'prod',
 'product',
 'quantile',
 'radd',
 'rank',
 'ravel',
 'rdiv',
 'rdivmod',
 'reindex',
 'reindex_like',
 'rename',
 'rename_axis',
 'reorder_levels',
 'repeat',
 'replace',
 'resample',
 'reset_index',
 'rfloordiv',
 'rmod',
 'rmul',
 'rolling',
 'round',
 'rpow',
 'rsub',
 'rtruediv',
 'sample',
 'searchsorted',
 'sem',
 'set_axis',
 'shape',
 'shift',
 'size',
 'skew',
 'slice_shift',
 'sort_index',
 'sort_values',
 'squeeze',
 'std',
 'str',
 'sub',
 'subtract',
 'sum',
 'swapaxes',
 'swaplevel',
 'tail',
 'take',
 'to_clipboard',
 'to_csv',
 'to_dict',
 'to_excel',
 'to_frame',
 'to_hdf',
 'to_json',
 'to_latex',
 'to_list',
 'to_markdown',
 'to_numpy',
 'to_period',
 'to_pickle',
 'to_sql',
 'to_string',
 'to_timestamp',
 'to_xarray',
 'transform',
 'transpose',
 'truediv',
 'truncate',
 'tshift',
 'tz_convert',
 'tz_localize',
 'unique',
 'unstack',
 'update',
 'value_counts',
 'values',
 'var',
 'view',
 'where',
 'xs']

In [15]:
from pandas import DataFrame
data = DataFrame({'Qui1':[1,3,5,6,8],
                 'Qu2':[2,6,7,9,11],
                 'Qu3':[3,9,1,10,21]})

In [16]:
data

   Qui1  Qu2  Qu3
0     1    2    3
1     3    6    9
2     5    7    1
3     6    9   10
4     8   11   21

Passing pandas.value_counts to this DataFrame’s apply function gives:

In [17]:
result = data.apply(pd.value_counts).fillna(0)

In [18]:
result

    Qui1  Qu2  Qu3
1    1.0  0.0  1.0
2    0.0  1.0  0.0
3    1.0  0.0  1.0
5    1.0  0.0  0.0
6    1.0  1.0  0.0
7    0.0  1.0  0.0
8    1.0  0.0  0.0
9    0.0  1.0  1.0
10   0.0  0.0  1.0
11   0.0  1.0  0.0
21   0.0  0.0  1.0

# Using a DataFrame’s Columns
It’s not unusual to want to use one or more columns from a DataFrame as the row  
index; alternatively, you may wish to move the row index into the DataFrame’s columns. Here’s an example DataFrame:

In [19]:
frame = DataFrame({'a':range(7), 'b':range(7,0,-1),
                  'c':['one','one','one','two','two','two','two'],
                  'd':[0,1,2,0,1,2,3]})

In [20]:
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

DataFrame’s set_index function will create a new DataFrame using one or more of its
columns as the index:

In [21]:
frame2 = frame.set_index(['c','d'])

In [22]:
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

By default the columns are removed from the DataFrame, though you can leave them in:

In [24]:
frame.set_index(['c','d'], drop=False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

reset_index, on the other hand, does the opposite of set_index; the hierarchical index
levels are are moved into the columns:

In [25]:
frame2.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

In [26]:
import pandas_datareader as web

C:\Users\ferna\Anaconda3\lib\site-packages\pandas_datareader\compat\__init__.py:7: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  from pandas.util.testing import assert_frame_equal

In [30]:
pdata = (dict((stk, web.get_data_yahoo(stk, '1/1/2009','6/1/2012')) for stk in ['AAPL','GOOG','MSFT','DELL']))

C:\Users\ferna\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: The Panel class is removed from pandas. Accessing it from the top-level namespace will also be removed in the next version
  """Entry point for launching an IPython kernel.

KeyError: 'Date'

In [31]:
empty = pd.Panel()

C:\Users\ferna\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: The Panel class is removed from pandas. Accessing it from the top-level namespace will also be removed in the next version
  """Entry point for launching an IPython kernel.

# Data Loading, Storage, and File Formats

## Reading and Writing Data in Text Format

### <font color = 'blue'>pandas features a number of functions for reading tabular data as a DataFrame object.Table 6-1 has a summary of all of them, though read_csv and read_table are likely the ones you’ll use the most.</font>

Function Description  
read_csv Load delimited data from a file, URL, or file-like object. Use comma as default delimiter  
read_table Load delimited data from a file, URL, or file-like object. Use tab ('\t') as default delimiter  
read_fwf Read data in fixed-width column format (that is, no delimiters)  
read_clipboard Version ofread_tablethat reads data from the clipboard. Useful for converting tables from web pages

In [1]:
import pandas as pd

In [5]:
df = pd.read_csv('binary.csv')

In [6]:
df

   admit  gre   gpa  rank
0      0  380  3.61     3
1      1  660  3.67     3
2      1  880  4.00     1
3      1  640  3.19     4
4      0  520  2.93     4

In [11]:
frame = pd.read_csv('dados_pessoais.csv')

In [12]:
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

To read this in, you have a couple of options. You can allow pandas to assign default
column names, or you can specify names yourself:

In [13]:
frame = pd.read_csv('dados_pessoais.csv', header=None)

In [14]:
frame

   0   1   2   3        4
0  a   b   c   d  message
1  1   2   3   4    hello
2  5   6   7   8    world
3  9  10  11  12      foo

In [15]:
pd.read_csv('dados_pessoais.csv', names=['a','b','c','d', 'message'])

   a   b   c   d  message
0  a   b   c   d  message
1  1   2   3   4    hello
2  5   6   7   8    world
3  9  10  11  12      foo

Suppose you wanted the message column to be the index of the returned DataFrame.  
You can either indicate you want the column at index 4 or named 'message' using the  
index_col argument:

In [16]:
names = ['a','b','c','d','message']

In [19]:
pd.read_csv('dados_pessoais.csv', names=names, index_col='message')

         a   b   c   d
message
message  a   b   c   d
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [20]:
list(open('Dados.txt'))

['a,b,c,d,message\n', '1,2,3,4,hello\n', '5,6,7,8,world\n', '9,10,11,12,foo']

In [21]:
result = pd.read_table('Dados.txt', sep='\s+')

In [22]:
result

  a,b,c,d,message
0   1,2,3,4,hello
1   5,6,7,8,world
2  9,10,11,12,foo

Because there was one fewer column name than the number of data rows, read_table  
infers that the first column should be the DataFrame’s index in this special case.  
The parser functions have many additional arguments to help you handle the wide  
variety of exception file formats that occur (see Table 6-2). For example, you can skip  
the first, third, and fourth rows of a file with skiprows:

In [3]:
pd.read_table('Dados.txt', skiprows=[0,1])

    5,6,7,8,world
0  9,10,11,12,foo

# Reading Text Files in Pieces
When processing very large files or figuring out the right set of arguments to correctly  
process a large file, you may only want to read in a small piece of a file or iterate through  
smaller chunks of the file.

If you want to only read out a small number of rows (avoiding reading the entire file),
specify that with nrows:

In [4]:
file = pd.read_csv('dados_pessoais.csv')

In [5]:
file

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [7]:
pd.read_csv('dados_pessoais.csv', nrows=1)

   a  b  c  d message
0  1  2  3  4   hello

# Writing Data Out to Text Format
Data can also be exported to delimited format. Let’s consider one of the CSV files read
above:

In [8]:
data = pd.read_csv('dados_pessoais.csv')

In [9]:
data

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

Using DataFrame’s to_csv method, we can write the data out to a comma-separated file:

In [12]:
coma = data.to_csv('dados_pessoais.csv')

In [17]:
import sys

In [18]:
data.to_csv(sys.stdout, sep='|')

|a|b|c|d|message
0|1|2|3|4|hello
1|5|6|7|8|world
2|9|10|11|12|foo

With no other options specified, both the row and column labels are written. Both of
these can be disabled:

Missing values appear as empty strings in the output. You might want to denote them
by some other sentinel value:

In [19]:
data.to_csv(sys.stdout, na_rep='NULL')

,a,b,c,d,message
0,1,2,3,4,hello
1,5,6,7,8,world
2,9,10,11,12,foo

With no other options specified, both the row and column labels are written. Both of
these can be disabled:

In [20]:
data.to_csv(sys.stdout, index=False, header=False )

1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

TypeError: to_csv() got an unexpected keyword argument 'colums'

# Manually Working with Delimited Formats
Most forms of tabular data can be loaded from disk using functions like pan  
das.read_table. In some cases, however, some manual processing may be necessary.  
It’s not uncommon to receive a file with one or more malformed lines that trip up  
read_table. To illustrate the basic tools, consider a small CSV file:

In [891]: !cat ch06/ex7.csv  
"a","b","c"  
"1","2","3"  
"1","2","3","4"  
For any file with a single-character delimiter, you can use Python’s built-in csv module.  
To use it, pass any open file or file-like object to csv.reader:

In [25]:
import csv
f = open('dados_pessoais.csv')

In [28]:
f

In [26]:
reader = csv.reader(f)

In [29]:
reader

Iterating through the reader like a file yields tuples of values in each like with any quote
characters removed:

In [27]:
for line in reader:
    print(line)

['|a|b|c|d|message']
['0|1|2|3|4|hello']
['1|5|6|7|8|world']
['2|9|10|11|12|foo']